{
  "title": "ScratchPHP - Extensions",
  "template": "index",
  "data": {
    "content": "<h1>Extensions</h1>\n<p>Extensions are a powerful way to enhance and customize functionality in Scratch. They allow you to modify HTML, JavaScript, and CSS before they are exported—perfect for tasks like minifying CSS, injecting custom HTML, and more.</p>\n<p>Extensions can also listen to events emitted by Scratch PHP, giving you deeper control over the build process. Additionally, they can provide boilerplate code when creating new components and blocks, helping streamline development.</p>\n<h3 id=\"registration\">Registration</h3>\n<p>Extensions are registered in the <code>extensions</code> field of the scratch.json configuration file. Each extension must specify its fully qualified PSR-compliant namespace (e.g., <code>VendorNamespace\\\\PackageName\\\\ExtensionClass</code>).</p>\n<pre><code class=\"language-json\">{\n  &quot;extensions&quot;: {\n    &quot;VendorNamespace\\\\PackageName\\\\ExtensionClass&quot;: {}\n  }\n}\n</code></pre>\n<h3 id=\"settings_registry\">Settings Registry</h3>\n<p>Extensions can declare their own settings, which are registered when Scratch PHP initializes the extension. These settings can be accessed within the extension class and may be stored as static values if needed.</p>\n<p>When building multiple pages, Scratch PHP ensures that each extension is registered only once, preserving efficiency.</p>\n<pre><code class=\"language-json\">{\n  &quot;extensions&quot;: {\n    &quot;VendorNamespace\\\\PackageName\\\\ExtensionClass&quot;: {\n        &quot;allowToDoSomething&quot;: true\n    }\n  }\n}\n</code></pre>\n<h3 id=\"extension_interface\">Extension Interface</h3>\n<p><code>ExtensionClass</code> must implement the <code>Kenjiefx\\ScratchPHP\\App\\Extensions\\ExtensionsInterface</code>. Although the interface is currently empty, it may include required methods or implementation details in future releases.</p>\n<p>Please note that Scratch uses PHP’s Reflection API to verify that the extension implements the interface. If it does not, an error will be thrown during registration.</p>\n<h3 id=\"listensto_attribute\">ListensTo Attribute</h3>\n<p>To listen to events, define a method within your <code>ExtensionClass</code> and annotate it with the <code>Kenjiefx\\ScratchPHP\\App\\Events\\ListensTo</code> attribute. Pass the event class reference as the argument to the attribute.</p>\n<p>You can find all available event classes at the <a href=\"http://127.0.0.1:7743/apis/events.html\">Events documentation page.</a></p>\n<pre><code class=\"language-php\">&lt;?php \n\nnamespace VendorNamespace\\PackageName;\n\nuse Kenjiefx\\ScratchPHP\\App\\Events\\ListensTo;\nuse Kenjiefx\\ScratchPHP\\App\\Events\\PageBuildStartedEvent;\nuse Kenjiefx\\ScratchPHP\\App\\Extensions\\ExtensionsInterface;\n\nclass MyExtensionClass implements ExtensionsInterface {\n\n    #[ListensTo(PageBuildStartedEvent::class)]\n    public function doSomethingWhenPageBuildStarted(PageBuildStartedEvent $event) {\n        // Please see all the fields you can retrieve from this event in the events docs\n    }\n\n}\n</code></pre>\n",
    "updatedAt": 1752582113911
  }
}